valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCan_reg.h
/** \brief 930, Node 2 Timer Receive Timeout Register */
#define CAN0_N2_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0208930u)
/** Alias (User Manual Name) for CAN0_N2_NT_RTR.
* To use register names with standard convension, please use CAN0_N2_NT_RTR.
*/
#define CAN0_NTRTR2 (CAN0_N2_NT_RTR)

/** \brief 940, Node 2 Port Control Register */
#define CAN0_N2_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0208940u)
/** Alias (User Manual Name) for CAN0_N2_NPCR.
* To use register names with standard convension, please use CAN0_N2_NPCR.
*/
#define CAN0_NPCR2 (CAN0_N2_NPCR)

/** \brief A00, Core Release Register 2 */
#define CAN0_N2_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0208A00u)
/** Alias (User Manual Name) for CAN0_N2_CREL.
* To use register names with standard convension, please use CAN0_N2_CREL.
*/
#define CAN0_CREL2 (CAN0_N2_CREL)

/** \brief A04, Endian Register 2 */
#define CAN0_N2_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0208A04u)
/** Alias (User Manual Name) for CAN0_N2_ENDN.
* To use register names with standard convension, please use CAN0_N2_ENDN.
*/
#define CAN0_ENDN2 (CAN0_N2_ENDN)

/** \brief A0C, Data Bit Timing & Prescaler Register 2 */
#define CAN0_N2_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF0208A0Cu)
/** Alias (User Manual Name) for CAN0_N2_DBTP.
* To use register names with standard convension, please use CAN0_N2_DBTP.
*/
#define CAN0_DBTP2 (CAN0_N2_DBTP)

/** \brief A10, Test Register 2 */
#define CAN0_N2_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0208A10u)
/** Alias (User Manual Name) for CAN0_N2_TEST.
* To use register names with standard convension, please use CAN0_N2_TEST.
*/
#define CAN0_TEST2 (CAN0_N2_TEST)

/** \brief A14, RAM Watchdog 2 */
#define CAN0_N2_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0208A14u)
/** Alias (User Manual Name) for CAN0_N2_RWD.
* To use register names with standard convension, please use CAN0_N2_RWD.
*/
#define CAN0_RWD2 (CAN0_N2_RWD)

/** \brief A18, CC Control Register 2 */
#define CAN0_N2_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0208A18u)
/** Alias (User Manual Name) for CAN0_N2_CCCR.
* To use register names with standard convension, please use CAN0_N2_CCCR.
*/
#define CAN0_CCCR2 (CAN0_N2_CCCR)

/** \brief A1C, Nominal Bit Timing & Prescaler Register 2 */
#define CAN0_N2_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF0208A1Cu)
/** Alias (User Manual Name) for CAN0_N2_NBTP.
* To use register names with standard convension, please use CAN0_N2_NBTP.
*/
#define CAN0_NBTP2 (CAN0_N2_NBTP)

/** \brief A20, Timestamp Counter Configuration 2 */
#define CAN0_N2_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0208A20u)
/** Alias (User Manual Name) for CAN0_N2_TSCC.
* To use register names with standard convension, please use CAN0_N2_TSCC.
*/
#define CAN0_TSCC2 (CAN0_N2_TSCC)

/** \brief A24, Timestamp Counter Value 2 */
#define CAN0_N2_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0208A24u)
/** Alias (User Manual Name) for CAN0_N2_TSCV.
* To use register names with standard convension, please use CAN0_N2_TSCV.
*/
#define CAN0_TSCV2 (CAN0_N2_TSCV)

/** \brief A28, Timeout Counter Configuration 2 */
#define CAN0_N2_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0208A28u)
/** Alias (User Manual Name) for CAN0_N2_TOCC.
* To use register names with standard convension, please use CAN0_N2_TOCC.
*/
#define CAN0_TOCC2 (CAN0_N2_TOCC)

/** \brief A2C, Timeout Counter Value 2 */
#define CAN0_N2_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF0208A2Cu)
/** Alias (User Manual Name) for CAN0_N2_TOCV.
* To use register names with standard convension, please use CAN0_N2_TOCV.
*/
#define CAN0_TOCV2 (CAN0_N2_TOCV)

/** \brief A40, Error Counter Register 2 */
#define CAN0_N2_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0208A40u)
/** Alias (User Manual Name) for CAN0_N2_ECR.
* To use register names with standard convension, please use CAN0_N2_ECR.
*/
#define CAN0_ECR2 (CAN0_N2_ECR)

/** \brief A44, Protocol Status Register 2 */
#define CAN0_N2_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0208A44u)
/** Alias (User Manual Name) for CAN0_N2_PSR.
* To use register names with standard convension, please use CAN0_N2_PSR.
*/
#define CAN0_PSR2 (CAN0_N2_PSR)

/** \brief A48, Transmitter Delay Compensation Register 2 */
#define CAN0_N2_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0208A48u)
/** Alias (User Manual Name) for CAN0_N2_TDCR.
* To use register names with standard convension, please use CAN0_N2_TDCR.
*/
#define CAN0_TDCR2 (CAN0_N2_TDCR)

/** \brief A50, Interrupt Register 2 */
#define CAN0_N2_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0208A50u)
/** Alias (User Manual Name) for CAN0_N2_IR.
* To use register names with standard convension, please use CAN0_N2_IR.
*/
#define CAN0_IR2 (CAN0_N2_IR)

/** \brief A54, Interrupt Enable 2 */
#define CAN0_N2_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0208A54u)
/** Alias (User Manual Name) for CAN0_N2_IE.
* To use register names with standard convension, please use CAN0_N2_IE.
*/
#define CAN0_IE2 (CAN0_N2_IE)

/** \brief A80, Global Filter Configuration 2 */
#define CAN0_N2_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0208A80u)
/** Alias (User Manual Name) for CAN0_N2_GFC.
* To use register names with standard convension, please use CAN0_N2_GFC.
*/
#define CAN0_GFC2 (CAN0_N2_GFC)

/** \brief A84, Standard ID Filter Configuration 2 */
#define CAN0_N2_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0208A84u)
/** Alias (User Manual Name) for CAN0_N2_SIDFC.
* To use register names with standard convension, please use CAN0_N2_SIDFC.
*/
#define CAN0_SIDFC2 (CAN0_N2_SIDFC)

/** \brief A88, Extended ID Filter Configuration 2 */
#define CAN0_N2_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0208A88u)
/** Alias (User Manual Name) for CAN0_N2_XIDFC.
* To use register names with standard convension, please use CAN0_N2_XIDFC.
*/
#define CAN0_XIDFC2 (CAN0_N2_XIDFC)

/** \brief A90, Extended ID AND Mask 2 */
#define CAN0_N2_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0208A90u)
/** Alias (User Manual Name) for CAN0_N2_XIDAM.
* To use register names with standard convension, please use CAN0_N2_XIDAM.
*/
#define CAN0_XIDAM2 (CAN0_N2_XIDAM)

